app/controllers/decisions_controller.rb

	def index
		@decisions = Decision.all
---
SELECT "decisions".* FROM "decisions"

	def show
		@decision = Decision.find params[:id]
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT 1  [["id", "1"]]

	def create
		@decision = Decision.new params[:decision]
		@decision.save
---
INSERT INTO "decisions" ("created_at", "description", "option1_name", "option1_picture", "option2_name", "option2_picture", "question", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@decision = Decision.find params[:id]
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT 1  [["id", "1"]]

	def update
		@decision = Decision.find params[:id]
		if @decision.update_attributes params[:decision]
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "decisions" SET "description" = 'Should i stay or should I go?', "option1_name" = 'Yes', "option2_name" = 'No', "updated_at" = '2013-04-09 18:25:13.217448' WHERE "decisions"."id" = 1

	def destroy
		@decision = Decision.find params[ :id]
		@decision.destroy
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "decisions" WHERE "decisions"."id" = ?  [["id", 1]]